app/controllers/admin/articles_controller.rb

  def create
    @article = Article.new(params[:article])

    if @article.save
---
INSERT INTO "articles" ("updated_at", "title", "category_id", "subtitle", "link", "created_at") VALUES('2009-03-01 17:40:15', '', 1, '', '', '2009-03-01 17:40:15')

  def update
    @article = Article.find(params[:id])

    if @article.update_attributes(params[:article])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)
UPDATE "articles" SET "title" = 'ertyerty', "subtitle" = 'ertyerty', "updated_at" = '2009-03-01 17:42:49' WHERE "id" = 1