app/controllers/admin/categories_controller.rb

SELECT * FROM "categories"
---
  def index
    @categories = Category.all :order => 'archived ASC, position ASC'